# Задача "Все ли равны?":

first = input('Введите 1-е число: ')
second = input('Введите 2-е число: ')
third = input('Введите 3-е число: ')

if first == second and second == third:
    print("3")
elif first == second or second == third or first == third:
    print("2")
else:
    print("0")

''' ПРАКТИЧЕСКОЕ ЗАДАНИЕ
2023/09/28 00:00|Домашняя работа по уроку "Условная конструкция. Операторы if, elif, else."
Цель: применить навыки создания условных конструкций и знания операторов if, else, elif / and, or, not.

Задача "Все ли равны?":
На вход программе подаются 3 целых числа и записываются в переменные first, second и third соответственно.
Ваша задача написать условную конструкцию (из if, elif, else), которая выводит кол-во одинаковых чисел среди 3-х введённых.

Пункты задачи:
Если все числа равны между собой, то вывести 3
Если хотя бы 2 из 3 введённых чисел равны между собой, то вывести 2
Если равных чисел среди 3-х вообще нет, то вывести 0

Пример результата выполнения программы:
Ввод в консоль 1:
123
456
789

Вывод на консоль 1:
0

Ввод в консоль 2:
42
69
42

Вывод на консоль 2:
2

Примечания:
Помните, что условная конструкция начинается с if.
Операторы elif и else не могут существовать самостоятельно, они являются продолжением условной конструкции.
Старайтесь избегать вложенности условий и описывать их, используя операторы or, and и not.
Самое хорошее решение не только самое быстрое, но ещё и хорошо читаемое!
Файл с кодом (module_2_2.py) прикрепите к домашнему заданию или пришлите ссылку на ваш GitHub репозиторий с файлом решения.

Успехов!
 
 https://github.com/maryaposohova/lesson0/blob/main/2задача.py'''