# Практическое задание по уроку "Строки и индексация строк"

example = 'Автомобиль'
print(example[0])
print(example[-1])
print(example[5:])
print(example[::-1])
print(example[0::2])

example = 'Топинамбур'
print(example[0])
print(example[-1])
print(example[5:])
print(example[::-1])
print(example[0::2])

'''
 ПРАКТИЧЕСКОЕ ЗАДАНИЕ
2023/09/21 00:00|Практическое задание по уроку "Строки и индексация строк"
Практическое задание по уроку "Строки и индексация строк"

Цель: Научиться работать со строками и индексацией строк в Python.
Задача:
Выполните следующие действия в PyCharm:
В переменную example запишите любую строку.
Выведите на экран(в консоль) первый символ этой строки.
Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
Выведите на экран(в консоль) это слово наоборот.
Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')
Пример результата работы вашего кода:


Вводные данные:
example = 'Топинамбур'
Вывод на экран(в консоль):
Т
р
амбур
рубманипоТ
оиабр
Примечания:
Для вывода значений на экран используйте функцию print()
Для доступа к символу строки по индексу используйте квадратные скобки и индекс символа ('Urban'[3] -  четвёртый символ строки 'Urban' - 'a')
Индексация начинается с нуля.

Напишите код к домашнему заданию в ответе (комметарии).

Успехов!

https://github.com/maryaposohova/lessons/blob/main/Дз1урока.py
'''